# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'nyancat'

# Development

# Apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'balsamiq-mockups'
cask 'bartender'
cask 'battle-net'
cask 'bettertouchtool'
cask 'caffeine'
cask 'calibre'
cask 'cheatsheet'
cask 'dash'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'iterm2'
cask 'rescuetime'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tower'
cask 'transmission'
cask 'vlc'
cask 'xld'
cask '1password'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
# cask 'font-sauce-code-powerline'
cask 'font-source-code-pro-for-powerline'

# Install Mac App Store apps
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas '1blocker', id: 1107421413
mas 'bettersnaptool', id: 417375580,
mas 'fantastical 2', id: 975937182

